src/main/resources/wsdl/HolaMundo.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions name="HolaMundo" targetNamespace="urn:com.ec.tvcable.switchaprov:switch-aprovisionamiento:1.0" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="urn:com.ec.tvcable.switchaprov:switch-aprovisionamiento:1.0" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
  <wsdl:types>
<xsd:schema xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="urn:com.ec.tvcable.switchaprov:switch-aprovisionamiento:1.0" attributeFormDefault="unqualified" elementFormDefault="qualified" targetNamespace="urn:com.ec.tvcable.switchaprov:switch-aprovisionamiento:1.0">
  <xsd:element name="saludar" type="tns:saludar"/>
  <xsd:complexType name="saludar">
    <xsd:sequence>
      <xsd:element minOccurs="0" name="string" type="xsd:string"/>
    </xsd:sequence>
  </xsd:complexType>
  <xsd:element name="saludarResponse" type="tns:saludarResponse"/>
  <xsd:complexType name="saludarResponse">
    <xsd:sequence>
      <xsd:element minOccurs="0" name="string" type="xsd:string"/>
    </xsd:sequence>
  </xsd:complexType>
</xsd:schema>
  </wsdl:types>
  <wsdl:message name="saludar">
    <wsdl:part name="parameters" element="tns:saludar">
    </wsdl:part>
  </wsdl:message>
  <wsdl:message name="saludarResponse">
    <wsdl:part name="parameters" element="tns:saludarResponse">
    </wsdl:part>
  </wsdl:message>
  <wsdl:portType name="HolaMundoPortType">
    <wsdl:operation name="saludar">
      <wsdl:input name="saludar" message="tns:saludar">
    </wsdl:input>
      <wsdl:output name="saludarResponse" message="tns:saludarResponse">
    </wsdl:output>
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="HolaMundoSoapBinding" type="tns:HolaMundoPortType">
    <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
    <wsdl:operation name="saludar">
      <soap:operation soapAction="saludar" style="document"/>
      <wsdl:input name="saludar">
        <soap:body use="literal"/>
      </wsdl:input>
      <wsdl:output name="saludarResponse">
        <soap:body use="literal"/>
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="HolaMundo">
    <wsdl:port name="HolaMundoPort" binding="tns:HolaMundoSoapBinding">
      <soap:address location="http://localhost:8080/switch-aprovisionamiento/HolaMundo"/>
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>
